EDT/УТ/src/Documents/ЗакрытиеСменыККМ/ЗакрытиеСменыККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеСменыККМ</name>
  <registerRecords>InformationRegister.СостояниеСменККМ</registerRecords>
  <attributes>
    <name>ККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.Кассиры</types>
    </type>
  </attributes>
  <attributes>
    <name>УТЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СостояниеСменККМ/СостояниеСменККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеСменККМ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СостояниеСмены</name>
    <type>
      <types>EnumRef.СостояниеСменККМ</types>
    </type>
  </resources>
  <resources>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.Кассиры</types>
    </type>
  </resources>
  <resources>
    <name>График</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыКассиров</types>
    </type>
  </resources>
  <dimensions>
    <name>ККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/СостояниеСменККМ/СостояниеСменККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеСменККМ</name>
  <enumValues>
    <name>СменаОткрыта</name>
  </enumValues>
  <enumValues>
    <name>СменаЗакрыта</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/ЗакрытиеСменыККМ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ксСостояниеСменККМ
	Движения.СостояниеСменККМ.Записывать = Истина;
	Движение = Движения.СостояниеСменККМ.Добавить();
	Движение.Период = Дата;
	Движение.ККМ = ККМ;
	Движение.СостояниеСмены = Перечисления.СостояниеСменККМ.СменаЗакрыта;
	Движение.Кассир = Кассир;
КонецПроцедуры
